app/controllers/users_controller.rb

  def index
    user_state = params[:state]

    render jsonapi: user_state.blank ? User.all : User.send(user_state.to_s) if validate_state!(state)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1